[
  {
    "id": 1,
    "content": "You give off major 'Final Girl' energy — like you'd totally survive a Scream movie.",
    "received": "5 minutes ago"
  },
  {
    "id": 2,
    "content": "If I had the Colossal Titan’s power, I’d still choose to break down emotional walls for you instead.",
    "received": "15 minutes ago"
  },
  {
    "id": 3,
    "content": "You're basically the Bocchi of our group — anxious, lovable, and secretly the most talented.",
    "received": "1 hour ago"
  },
  {
    "id": 4,
    "content": "You're like Frieren — quiet, thoughtful, and somehow carrying more magic than anyone else around.",
    "received": "3 hours ago"
  },
  {
    "id": 5,
    "content": "If I had a Death Note... don't worry, you’d be safe. You’re one of the good ones.",
    "received": "6 hours ago"
  },
  {
    "id": 6,
    "content": "Sometimes you look like you're carrying the weight of the world, Eren-style. Just remember, you're not alone.",
    "received": "9 hours ago"
  },
  {
    "id": 7,
    "content": "You remind me of L — mysterious, brilliant, and probably running on caffeine and intuition.",
    "received": "12 hours ago"
  },
  {
    "id": 8,
    "content": "If life were an anime, you'd definitely be the misunderstood protagonist with a loyal fanbase.",
    "received": "1 day ago"
  },
  {
    "id": 9,
    "content": "Not gonna lie… I’d watch 12 episodes of you just trying to survive social situations — Bocchi-style.",
    "received": "2 days ago"
  },
  {
    "id": 10,
    "content": "If we were in Frieren’s world, I think you'd be the one who makes the journey matter.",
    "received": "3 days ago"
  },
  {
    "id": 11,
    "content": "You give off Makima vibes — calm on the surface, but there's something powerful and terrifyingly cool underneath.",
    "received": "4 days ago"
  },
  {
    "id": 12,
    "content": "You're like Anya from Spy x Family — chaotic, adorable, and way more insightful than you let on.",
    "received": "5 days ago"
  },
  {
    "id": 13,
    "content": "Sometimes you talk like you're Gojo — effortlessly charming with just enough danger to be irresistible.",
    "received": "5 days ago"
  },
  {
    "id": 14,
    "content": "You're basically the Kurisu Makise of your timeline — brilliant, sarcastic, and always five steps ahead.",
    "received": "6 days ago"
  },
  {
    "id": 15,
    "content": "If we lived in a Studio Ghibli movie, you'd be the quiet forest spirit everyone is secretly in love with.",
    "received": "6 days ago"
  },
  {
    "id": 16,
    "content": "You remind me of Kiki — figuring it out one day at a time with heart, hustle, and a whole lot of charm.",
    "received": "1 week ago"
  },
  {
    "id": 17,
    "content": "You're giving strong Yuta from Jujutsu Kaisen energy — underestimated, but actually unstoppable.",
    "received": "1 week ago"
  },
  {
    "id": 18,
    "content": "If we were in Mob Psycho 100, you’d be the emotional center — pure-hearted and more powerful than you realize.",
    "received": "1 week ago"
  },
  {
    "id": 19,
    "content": "You're like Nana Osaki — cool as hell on the outside, but soft where it counts.",
    "received": "1 week ago"
  },
  {
    "id": 20,
    "content": "You have that Shinji Ikari vibe — complicated, sensitive, and just trying your best to stay human in a chaotic world.",
    "received": "1 week ago"
  }
]
